<?php
// +----------------------------------------------------------------------
// | TRACE CREATE BY FJW IN 2017-5-12
// +----------------------------------------------------------------------
// | Copyright (c) 2017~now
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: fjwcoder <fjwcoder@gmail.com>
// +----------------------------------------------------------------------

//【应用入口文件】
if (version_compare(PHP_VERSION, '5.4.0', '<')){ //提示所需PHP版本必须为5.5.6以上
	die('require PHP > 5.4.0 !');
}
// 定义应用目录
define('APP_PATH', __DIR__ . '/../app/');
define('APP_DEBUG', true);
//定义 【惯例配置】 文件目录
define('CONF_PATH', __DIR__ . '/../conf/');
// 加载框架引导文件
require __DIR__ . '/../thinkphp/start.php'; //start.php 又引入了base.php
